disease = ['急性病毒性Ａ型肝炎', '登革熱', '急性病毒性Ｃ型肝炎', '流感併發重症', '流感併發重症', '流感併發重症', '流行性腮腺炎', '恙蟲病', '登革熱', '流感併發重症', '流感併發重症', '登革熱', '流感併發重症', '流感併發重症', '流感併發重症', '侵襲性肺炎鏈球菌感染症', '流行性腮腺炎', '流感併發重症', '流感併發重症', '侵襲性肺炎鏈球菌感染症', '流行性腮腺炎', '流感併發重症', '登革熱', '流行性腮腺炎', '流行性腮腺炎', '恙蟲病', '急性病毒性Ｃ型肝炎', '流行性腮腺炎', '流感併發重症', '流行性腮腺炎', '流感併發重症', '流感併發重症', '急性病毒性Ｃ型肝炎', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '急性病毒性Ａ型肝炎', '侵襲性肺炎鏈球菌感染症', '流行性腮腺炎', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '恙蟲病', '流感併發重症', '流感併發重症', '流感併發重症', '登革熱', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '侵襲性肺炎鏈球菌感染症', '急性病毒性Ａ型肝炎', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '急性病毒性Ｃ型肝炎', '流感併發重症', '急性病毒性Ｃ型肝炎', '恙蟲病', '急性病毒性Ｃ型肝炎', '流行性腮腺炎', '流感併發重症', '流感併發重症', '恙蟲病', '恙蟲病', '流感併發重症', '流感併發重症', '流感併發重症', '恙蟲病', '流感併發重症', '流感併發重症', '急性病毒性Ａ型肝炎', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '登革熱', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '恙蟲病', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '急性病毒性Ｃ型肝炎', '流感併發重症', '流感併發重症', '恙蟲病', '流感併發重症', '流感併發重症', '恙蟲病', '流感併發重症', '流感併發重症', '流感併發重症', '急性病毒性Ａ型肝炎', '急性病毒性Ｃ型肝炎', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '流行性腮腺炎', '恙蟲病', '恙蟲病', '侵襲性肺炎鏈球菌感染症', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '急性病毒性Ａ型肝炎', '恙蟲病', '登革熱', '流感併發重症', '流感併發重症', '流行性腮腺炎', '流行性腮腺炎', '急性病毒性Ｃ型肝炎', '流感併發重症', '侵襲性肺炎鏈球菌感染症', '流感併發重症', '流感併發重症', '侵襲性肺炎鏈球菌感染症', '急性病毒性Ａ型肝炎', '流感併發重症', '流感併發重症', '登革熱', '流感併發重症', '流感併發重症', '流感併發重症', '流感併發重症', '急性病毒性Ｃ型肝炎', '恙蟲病', '流感併發重症', '流感併發重症']
#資料有哪些不重複的種類、用for迴圈打印在終端機上
set(disease)
for d in set(disease):
    print(d)

#資料分組統計、用for迴圈打印在終端機上
disease.count(d)

for d in set(disease):
    print(d, disease.count(d))

#整理成字典:資料分組統計
disease_dic={}
for d in set(disease):
    disease_dic[d]=disease.count(d)
    
print(disease_dic)

#使用collection
# https://docs.python.org/3.6/library/collections.html
from collections import Counter
c=Counter(disease)

#哪種病出現最多次
c.most_common()[::-1]

#查找方法
?c






